In [53]:
import sqlite3
db=sqlite3.connect('School.sqlite')
db

In [54]:
cur=db.cursor()

In [15]:
sql_query ='create table Student (roll int primary key,name text,age int)'
cur.execute(sql_query)

OperationalError: table Student already exists

In [16]:
cur.execute('insert into Student values(102,"Amit",19)')

IntegrityError: UNIQUE constraint failed: Student.roll

In [56]:
db.commit()

In [25]:
db=sqlite3.connect('Employee.sqlite')
db

In [26]:
cur =db.cursor()

In [28]:
cur.execute('insert into EmployeeDetail values(105,"Amit",24,"Human Resource",76000)')

In [29]:
db.commit()

In [30]:
cur.execute('delete from EmployeeDetail where employeeid = 101')

In [31]:
db.commit()

In [34]:
cur.execute('delete from Employeedetail where employeeid =105')
db.commit()

In [35]:
id_1=102
cur.execute('delete from employeedetail where employeeid =?',(id_1, ))

In [36]:
db.commit()

In [58]:
cur.execute('select * from Student')
for row in cur:
    print(row)

(101, 'Aman', 18)
(102, 'Amit', 19)

### sqlite3 using pandas

In [96]:
import sqlite3
import pandas as pd
db=sqlite3.connect('School.sqlite')
data=pd.read_sql_query('select * from student',db)
data

   roll  name  age
0   101  Aman   18
1   102  Amit   19

In [98]:
data[data['age']==18]

   roll  name  age
0   101  Aman   18

### inserting new table in data frame

In [101]:
data=pd.DataFrame([[101,"aman","science",22000],[102,"anmol","maths",20000],[103,"amit","english",18000]],
                 columns=['ID','Name','Subject','Salary'])

In [102]:
data

    ID   Name  Subject  Salary
0  101   aman  science   22000
1  102  anmol    maths   20000
2  103   amit  english   18000

In [104]:
db=sqlite3.connect('faculty.sqlite')

In [105]:
data.to_sql("faculty",db)

In [106]:
data

    ID   Name  Subject  Salary
0  101   aman  science   22000
1  102  anmol    maths   20000
2  103   amit  english   18000

In [107]:
db=sqlite3.connect('School.sqlite')

### updating new column through dataframe

In [112]:
data=pd.read_sql_query('select * from student',db)
data["address"]="Test"
data.to_sql("Student",db,if_exists="replace")

   roll  name  age Address
0   101  Aman   18    test
1   102  Amit   19    test

### Questions  1
A given data of 12 Employees working in an investment firm. So add the Employee Data in Employee SQLite Database of Employee_Detail Table which was created by you.

In [ ]:
db=sqlite3.connect('Employee.sqlite')
cur=db.cursor()

In [49]:
employee_id=[107,108,109,110,111,112,113]
name=['Vaibhav','Himanshu','Raman','Kunal','Adhira','Tanya']
age=[25,27,25,24,30,26,23,26,25,26,29,24]
department=['Finance','IT','Operations','Marketing','Human Resource','Marketing']
salary=[85000,90000,60000,50000,75000,50000]

In [50]:
for i in range(6):
    cur.execute('insert into employeedetail values(?,?,?,?,?)',(employee_id[i],name[i],age[i],department[i],salary[i]))

In [51]:
db.commit()

In [52]:
cur.execute('delete from employeedetail where employeeid =100')
db.commit()

### Question 2
Find the employee_id of employee whose is working in Finance Department in Investment firm from Employee SQLite Database.
Print the employee_id as integer value

In [67]:
db=sqlite3.connect('Employee.sqlite')
cur=db.cursor()

In [78]:
cur.execute('select employeeid from employeedetail where department ="Finance"')

In [79]:
for i in cur:
    print(i)

(103,)
(107,)

### Question 3
Find the number of employee working in different department in an investment firm from Employee SQLite Database.
Print the department and number of employee

In [80]:
db=sqlite3.connect('Employee.sqlite')
cur=db.cursor()

In [95]:
cur.execute('select department,count(*) from employeedetail group by department')
ans=cur.fetchall()
for row in ans:
    print(row[0],row[1])

Finance 2
Human Resource 2
IT 2
Marketing 4
Operations 2

### Question 4
Count Genre

IMDB.sqlite' database contains all details of movies and has three tables with name IMDB, genre and earning.
Find the count of each genre present in IMDB movie dataset?
Print the Genre and number of movies present in that genre.
Note: Ignore the empty value present in genre.

In [181]:
import pandas as pd
import sqlite3
db=sqlite3.connect('IMDB.sqlite')
data=pd.read_sql_query('select * from genre',db)
dic=dict()
for row in data['genre']:
    dic[row]=dic.get(row,0)+1
for i in dic:
    if i!='':
        print(i,dic[i])

Biography 21
Adventure 43
Comedy 31
Drama 77
Action 33
Animation 13
Crime 11
Mystery 7
Romance 13
Thriller 14
History 6
Sport 3
Western 2
Sci-Fi 18
Family 3
Musical 1
Fantasy 7
War 2
Horror 2
Music 3

#### question 5
IMDB Movie

IMDB.sqlite' database contains all details of movies and has three tables with name IMDB, genre and earning.
Find the highest-grossing movie (i.e domestic earning + worldwide earning) in IMDB database.
Print the rating of that movie.

In [191]:
import sqlite3
import pandas as pd
db=sqlite3.connect('IMDB.sqlite')
data=pd.read_sql_query('select i.movie_id,rating ,domestic,worldwide from imdb i join earning e on i.movie_id =e.movie_id',db)
data['Total']=data['Domestic']+data['Worldwide']
total=data['Rating'][data['Total'].argmax()]
total

8.1

## Assignments

IMDB Voted


IMDB.sqlite' database contains all details of movies and has three tables with name IMDB, genre and earning.
Find the most voted movie in IMDB Movie Database.
Print the movie name and the rating of that movie.

In [201]:
import sqlite3
import pandas as pd
db=sqlite3.connect('IMDB.sqlite')
data=pd.read_sql_query('select max(TotalVotes),Title,rating from IMDB',db)
print(data['Title'][0],data['Rating'][0])

Inception (2010) 8.8

In [200]:
print(data['Title'][0],data['Rating'][0])

Inception (2010) 8.8

In [277]:
import sqlite3
import pandas as pd
import numpy as np
db=sqlite3.connect('IMDB.sqlite')
data=pd.read_sql_query('select Title,Runtime from IMDB',db)
data['Runtime'].dropna(inplace =True)
data['Runtime'][data['Runtime']=='']='0 min'
def split(a):
    a=a.split(' ')
    a=a[0]
    return a
data['Runtime']=data['Runtime'].apply(split)
data['Runtime']=data['Runtime'].astype(float)

data.sort_values(by ='Runtime',inplace =True,ascending =False)
data.reset_index(drop=True,inplace =True)
print(data['Title'][0],int(data['Runtime'][0]))

The Wolf of Wall Street (2013) 180

In [243]:
import sqlite3
import pandas as pd

db = sqlite3.connect('IMDB.sqlite')
mov = pd.read_sql_query("Select Title,runtime from IMDB", db)

mov['Runtime'].dropna(inplace=True)
mov['Runtime'][mov.Runtime == ''] = '0 min'
mov['Runtime'] = mov['Runtime'].apply(lambda x: str(x).split(" ")[0])
mov['run']=mov['Runtime'][:-4]
mov['run'] = mov['run'].astype(float)

mov.sort_values(by="run",inplace=True,ascending=False)
mov.reset_index(drop=True,inplace=True)

print(mov.Title[0],end=" ")
print(int(mov.run[0]))

The Wolf of Wall Street (2013) 180